src/test/jmeter/aggregate improve report.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Home page,5000,4225,4554,5555,5828,6217,8,8415,0.000%,3.67657,10.61,0.42
CSS,5000,4201,4507,5543,5823,6215,2,8391,0.000%,3.66694,1033.87,0.51
JS,5000,4212,4505,5535,5816,6273,2,8372,0.000%,3.65942,288.57,0.59
Vets,5000,4279,4570,5587,5828,6288,9,8440,0.000%,3.65139,15.28,0.45
Find owner,5000,4295,4553,5573,5848,6323,10,8400,0.000%,3.64257,12.67,0.45
"Find owner with lastname=""""",5000,8722,9036,10890,11833,13502,120,19733,0.000%,3.62188,18.57,0.47
Owner,5000,9550,9849,11754,12724,14764,318,19769,0.000%,3.58805,1403.19,0.43
Edit Owner,5000,6516,6766,7984,8639,10025,53,14510,0.000%,3.58251,18.53,0.45
POST Edit Owner,5000,6514,6755,8031,8633,10100,55,14761,0.000%,3.57748,18.88,1.03
New Pet,5000,17046,17176,22071,23848,27218,57,34591,0.000%,3.55584,16.85,0.46
POST new pet,5000,17447,17377,22544,24168,27548,63,34422,0.000%,3.53820,17.28,0.92
New visit,5000,8014,8184,9602,10136,12042,535,18164,0.000%,3.53302,1038.12,0.49
POST new visit,5000,18274,18811,22205,23237,25447,701,36405,0.000%,3.53258,1411.99,1.66
Find owner by lastname=Davis,5000,6557,6788,8080,8661,10113,63,14222,0.000%,3.53600,12.82,0.66
New Owner,5000,4359,4605,5610,5889,6391,12,8494,0.000%,3.53653,18.11,0.62
POST new owner,5000,4384,4626,5642,5934,6384,12,8510,0.000%,3.53664,18.67,1.21
TOTAL,80000,8037,6145,17577,19972,23594,2,36405,0.000%,56.28385,5259.68,10.64