src/test/jmeter/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Home page,5000,2509,2921,3843,4081,4384,6,4861,0.000%,6.77587,19.55,0.77
CSS,5000,2477,2885,3754,4026,4338,2,4796,0.000%,6.76531,1907.44,0.94
JS,5000,2457,2866,3738,4008,4348,2,4819,0.000%,6.75762,532.89,1.09
Vets,5000,2516,2925,3805,4065,4392,9,4852,0.000%,6.75354,28.27,0.82
Find owner,5000,2521,2919,3777,4028,4360,11,4857,0.000%,6.74759,23.48,0.84
"Find owner with lastname=""""",5000,5003,5519,7206,7693,9139,76,12367,0.000%,6.69678,34.34,0.86
Owner,5000,5436,5918,7766,8201,9657,185,13543,0.000%,6.66618,1582.77,0.81
Edit Owner,5000,3765,4156,5450,5769,6787,34,10235,0.000%,6.65783,34.44,0.84
POST Edit Owner,5000,3794,4183,5481,5793,6998,33,9733,0.000%,6.64560,35.07,1.91
New Pet,5000,9638,9954,13967,15138,17806,35,26105,0.000%,6.55678,31.08,0.85
POST new pet,5000,9810,10082,14213,15601,18383,36,29847,0.000%,6.52004,31.84,1.69
New visit,5000,4633,5068,6459,6771,8039,196,10609,0.000%,6.50689,1169.43,0.90
POST new visit,5000,10344,11330,14370,15148,16887,279,21154,0.000%,6.50443,1603.97,3.06
TOTAL,65000,4993,3944,11014,12761,15503,2,29847,0.000%,84.08307,6857.95,15.02